src/python.org
#+TITLE: Python virtualenv helpers
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle no

Distro-agnostic helpers for creating Python virtualenvs inside
containers. Used by both Alpine and Debian container builders.

#+begin_src python :tangle lib/python.py :noweb yes
import dagger
from dagger import function


class PythonMixin:

    <<python-venv>>

    <<python-user-venv>>
#+end_src

* Creating a Python venv

  A reusable helper to create a virtualenv with =--system-site-packages=
  and optionally install packages into it.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_env_variable]] with =expand=True= lets the value reference
  existing variables — here we prepend the venv's =bin/= directory to
  =$PATH= so that =python= and =pip= resolve to the venv copies without
  hard-coding the rest of the path.

  #+NAME: python-venv
  #+begin_src python
  @function
  def python_venv(
      self,
      ctr: dagger.Container,
      base: str,
      pip_packages: list[str] = (),
  ) -> dagger.Container:
      """Create a Python venv with --system-site-packages and optionally install packages."""
      ctr = ctr.with_exec([
          "python3", "-m", "venv", "--system-site-packages", f"{base}/venv",
      ]).with_env_variable("PATH", f"{base}/venv/bin:$PATH", expand=True)
      if pip_packages:
          ctr = ctr.with_exec(
              [f"{base}/venv/bin/python", "-m", "pip", "--quiet", "install", "--upgrade"]
              + list(pip_packages)
          )
      return ctr
  #+end_src

* Python with a user and virtualenv

  A higher-level helper that combines user creation, workdir setup, and
  virtualenv creation. Distro-specific wrappers (=alpine_python_user_venv=,
  =debian_python_user_venv=) call this after building their base container.

  #+NAME: python-user-venv
  #+begin_src python
  @function
  def python_user_venv(
      self,
      ctr: dagger.Container,
      groups: list[str] = (),
      pip_packages: list[str] = (),
      work_dir: str = "/app",
  ) -> dagger.Container:
      """Add a user, workdir, and virtualenv to a container that already has Python."""
      ctr = self.use_user(ctr, groups=groups)
      ctr = ctr.with_workdir(work_dir)
      return self.python_venv(ctr, base=work_dir, pip_packages=pip_packages)
  #+end_src
